Revit 2027 API
PrintManager.PaperSources Property
Get all print sources of current printer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PaperSourceSet PaperSources { get; }
Public ReadOnly Property PaperSources As PaperSourceSet
	Get
public:
property PaperSourceSet^ PaperSources {
	PaperSourceSet^ get ();
}
member PaperSources : PaperSourceSet with get
Property Value
PaperSourceSet
Remarks
These are the valid paper source for the current printer.
See Also
Reference
PrintManager Class
Autodesk.Revit.DB Namespace